<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use AnimeSite\Models\Tag;
use Illuminate\Support\Str;

class TagSeeder extends Seeder
{
    public function run(): void
    {
        $genres = [
            ['name' => 'Екшн', 'description' => 'Аніме з динамічними та напруженими сценами боїв і пригод.'],
            ['name' => 'Пригоди', 'description' => 'Аніме про епічні подорожі, відкриття та нові світи.'],
            ['name' => 'Романтика', 'description' => 'Аніме, що зосереджене на любовних відносинах між персонажами.'],
            ['name' => 'Комедія', 'description' => 'Аніме, яке має на меті розвеселити та подарувати хороший настрій.'],
            ['name' => 'Фентезі', 'description' => 'Аніме, дія якого відбувається у вигаданих світах з магією і чудесами.'],
            ['name' => 'Жахи', 'description' => 'Аніме, яке лякає, тримає у напрузі та має моторошну атмосферу.'],
            ['name' => 'Повсякденність', 'description' => 'Аніме про повсякденне життя, дружбу, школу та дорослішання.'],
            ['name' => 'Наукова фантастика', 'description' => 'Аніме, що досліджує майбутні технології, космос чи альтернативні реальності.'],
            ['name' => 'Ісекай', 'description' => 'Аніме про потрапляння героя в інший, зазвичай фентезійний, світ.'],
            ['name' => 'Надприродне', 'description' => 'Аніме з потойбічними силами, духами або магією в реальному світі.'],
            ['name' => 'Самурай', 'description' => 'Аніме з японською історичною атмосферою та бойовими мистецтвами.'],
            ['name' => 'Демони', 'description' => 'Аніме з темою боротьби з демонами та потойбічними істотами.'],
            ['name' => 'Війна', 'description' => 'Аніме про масштабні конфлікти, битви та стратегії.'],
            ['name' => 'Драма', 'description' => 'Аніме з глибокими сюжетами, що торкаються емоцій і внутрішніх конфліктів.'],
            ['name' => 'Містика', 'description' => 'Аніме з таємничими явищами і загадками.'],
            ['name' => 'Спорт', 'description' => 'Аніме з тематикою змагань і фізичних випробувань.'],
            ['name' => 'Трилер', 'description' => 'Аніме з напруженим сюжетом, що тримає глядача в постійному очікуванні.'],
            ['name' => 'Психологічний', 'description' => 'Аніме, що досліджує психіку персонажів та їхні внутрішні конфлікти.'],
            ['name' => 'Детектив', 'description' => 'Аніме про розслідування злочинів, загадки та таємниці.'],
            ['name' => 'Історичний', 'description' => 'Аніме, дія якого відбувається в історичному минулому.'],
            ['name' => 'Музичний', 'description' => 'Аніме, де музика відіграє центральну роль у сюжеті.'],
            ['name' => 'Школа', 'description' => 'Аніме, дія якого відбувається в школі або навколо шкільного життя.'],
            ['name' => 'Сьонен', 'description' => 'Аніме для хлопців-підлітків з екшеном та пригодами.'],
            ['name' => 'Сьодзьо', 'description' => 'Аніме для дівчат-підлітків з романтикою та повсякденністю.'],
            ['name' => 'Кодомо', 'description' => 'Аніме для дітей з простими та повчальними сюжетами.'],
            ['name' => 'Паранормальний', 'description' => 'Аніме з паранормальними явищами та надприродними здібностями.'],
            ['name' => 'Постапокаліпсис', 'description' => 'Аніме, дія якого відбувається після глобальної катастрофи.'],
            ['name' => 'Реінкарнація', 'description' => 'Аніме про перевтілення персонажів в іншому світі або житті.'],
        ];

        $tags = [
            ['name' => 'Цундере', 'description' => 'Персонаж, який зовні агресивний, але в глибині душі добрий і лагідний.'],
            ['name' => 'Яндере', 'description' => 'Персонаж, який надмірно одержимий коханням і може поводитись небезпечно.'],
            ['name' => 'Кудере', 'description' => 'Холоднокровний або спокійний персонаж, що іноді показує емоції.'],
            ['name' => 'Дандере', 'description' => 'Сором’язливий або мовчазний персонаж, який відкривається з часом.'],
            ['name' => 'Меко', 'description' => 'Персонаж із котячими вухами або іншими рисами кота.'],
            ['name' => 'Лолі', 'description' => 'Молодий або на вигляд дитячий жіночий персонаж.'],
            ['name' => 'Шота', 'description' => 'Молодий або на вигляд дитячий чоловічий персонаж.'],
            ['name' => 'Антигерой', 'description' => 'Головний персонаж, що має негативні риси або суперечливу мораль.'],
            ['name' => 'Сейю', 'description' => 'Тег для позначення озвучувачів (голосових акторів) персонажів.'],
            ['name' => 'Магія', 'description' => 'Аніме, де важливу роль відіграє магія, закляття або чарівники.'],
            ['name' => 'Роботи', 'description' => 'Аніме з участю великих бойових роботів або мехів.'],
            ['name' => 'Ігри', 'description' => 'Аніме, де сюжет обертається навколо відеоігор або віртуального світу.'],
            ['name' => 'Музика', 'description' => 'Аніме, пов’язане з музичними гуртами, співаками або музичними конкурсами.'],
            ['name' => 'Ідоли', 'description' => 'Аніме про айдолів, їхнє життя, сцену і тренування.'],
            ['name' => 'Ніндзя', 'description' => 'Аніме з фокусом на бойових мистецтвах і таємних агентів, як у "Наруто".'],
            ['name' => 'Пірати', 'description' => 'Аніме про морські пригоди, скарби та морських розбійників, як у "Ван Піс".'],
            ['name' => 'Шініґамі', 'description' => 'Персонажі, пов’язані з духами і світом мертвих, як у "Бліч".'],
            ['name' => 'Титани', 'description' => 'Велетенські істоти, з якими борються герої "Атаки Титанів".'],
            ['name' => 'Демони', 'description' => 'Антагоністи або темні сили, що зображені в "Клинку що знищує демонів".'],
            ['name' => 'Мечі', 'description' => 'Аніме, де головну роль відіграють бої на мечах.'],
            ['name' => 'Фентезійний світ', 'description' => 'Вигадані світи з магією, містикою і чудесами.'],
            ['name' => 'Дередере', 'description' => 'Завжди веселий, енергійний та позитивний персонаж.'],
            ['name' => 'Хіндере', 'description' => 'Персонаж, який любить критикувати та принижувати інших.'],
            ['name' => 'Садодере', 'description' => 'Персонаж, який отримує задоволення від завдання болю іншим.'],
            ['name' => 'Мазодере', 'description' => 'Персонаж, який отримує задоволення від болю або приниження.'],
            ['name' => 'Овер-павер', 'description' => 'Надзвичайно сильний персонаж, що перевершує всіх інших.'],
            ['name' => 'Слабкий до сильного', 'description' => 'Персонаж, який розвивається від слабкого до могутнього.'],
            ['name' => 'Алхімія', 'description' => 'Наука перетворення матерії та створення філософського каменю.'],
            ['name' => 'Турніри', 'description' => 'Змагання та турніри як центральна частина сюжету.'],
            ['name' => 'Гільдії', 'description' => 'Організації або групи персонажів з спільними цілями.'],
            ['name' => 'Академія', 'description' => 'Навчальні заклади для розвитку особливих здібностей.'],
            ['name' => 'Рейтинг сили', 'description' => 'Система рангів або рівнів сили персонажів.'],
            ['name' => 'Трансформації', 'description' => 'Здатність персонажів змінювати свою форму або силу.'],
            ['name' => 'Суперсили', 'description' => 'Персонажі з надлюдськими здібностями.'],
            ['name' => 'Бойові мистецтва', 'description' => 'Різні стилі та техніки рукопашного бою.'],
            ['name' => 'Магічні предмети', 'description' => 'Артефакти та предмети з магічними властивостями.'],
            ['name' => 'Помста', 'description' => 'Мотивація персонажів, заснована на бажанні помститися.'],
            ['name' => 'Кулінарія', 'description' => 'Аніме про готування їжі та кулінарні змагання.'],
        ];

        foreach ($genres as $genre) {
            Tag::create([
                'id' => Str::ulid(),
                'slug' => Tag::generateSlug($genre['name']),
                'name' => $genre['name'],
                'description' => $genre['description'],
                'aliases' => json_encode([]),
                'is_genre' => true,
                'meta_title' => Tag::makeMetaTitle($genre['name']),
                'meta_description' => Tag::makeMetaDescription($genre['description']),
                'image' => null,
                'meta_image' => null,
                'parent_id' => null,
            ]);
        }

        foreach ($tags as $tag) {
            Tag::create([
                'id' => Str::ulid(),
                'slug' => Tag::generateSlug($tag['name']),
                'name' => $tag['name'],
                'description' => $tag['description'],
                'aliases' => json_encode([]),
                'is_genre' => false,
                'meta_title' => Tag::makeMetaTitle($tag['name']),
                'meta_description' => Tag::makeMetaDescription($tag['description']),
                'image' => null,
                'meta_image' => null,
                'parent_id' => null,
            ]);
        }
    }
}
